# Data Processing Exercise

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("D:/Study/MCA/4th Sem/DA/csv/emp.csv")
df.head()

  id      name  salary  start_date        dept
0  1      Rick  623.30  01-01-2012          IT
1  2       Dan  515.20  23-09-2013  Operations
2  3  Michelle     NaN  15-11-2014          IT
3  4      Ryan  729.00  11-05-2014          HR
4         Gary  843.25  27-03-2015     Finance

In [3]:
# To check for missing values in column
df['name'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: name, dtype: bool

In [4]:
df['salary'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
Name: salary, dtype: bool

In [5]:
df['id'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: id, dtype: bool

In [6]:
df['salary'].sum()

13144.05

In [7]:
df['salary'].mean()

1877.7214285714285

In [8]:
#filling missing values
df['salary'].fillna(0)

0     623.30
1     515.20
2       0.00
3     729.00
4     843.25
5    8478.00
6    1032.80
7     922.50
Name: salary, dtype: float64

In [13]:
df = pd.read_csv('D:/Study/MCA/4th Sem/DA/csv/emp.csv')

In [12]:
# filling with nearby values
# bfill - backward fill
# ffill - forward fill
df['salary'].fillna(method='bfill')

0     623.30
1     515.20
2     729.00
3     729.00
4     843.25
5    8478.00
6    1032.80
7     922.50
Name: salary, dtype: float64

In [18]:
# dropping of na values
df['salary'].dropna()

0     623.30
1     515.20
3     729.00
4     843.25
5    8478.00
6    1032.80
7     922.50
Name: salary, dtype: float64

In [22]:
df = pd.read_csv('D:/Study/MCA/4th Sem/DA/csv/emp.csv')

In [23]:
df.head()

  id      name  salary  start_date        dept
0  1      Rick  623.30  01-01-2012          IT
1  2       Dan  515.20  23-09-2013  Operations
2  3  Michelle     NaN  15-11-2014          IT
3  4      Ryan  729.00  11-05-2014          HR
4         Gary  843.25  27-03-2015     Finance

In [24]:
df.dropna()

  id   name   salary  start_date        dept
0  1   Rick   623.30  01-01-2012          IT
1  2    Dan   515.20  23-09-2013  Operations
3  4   Ryan   729.00  11-05-2014          HR
4      Gary   843.25  27-03-2015     Finance
5  6   Nina  8478.00  21-05-2013          IT
6  7  Simon  1032.80  30-07-2013  Operations
7  8   Guru   922.50  17-06-2014     Finance

In [25]:
df['id'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: id, dtype: bool

In [34]:
# replace a value
# find string followed by replace string
df['name'].replace({"Rick" : "Mike"})

0        Mike
1         Dan
2    Michelle
3        Ryan
4        Gary
5        Nina
6       Simon
7        Guru
Name: name, dtype: object

In [35]:
df['id'].replace({1:0, 6:0})

0    0.0
1    2.0
2    3.0
3    4.0
4    NaN
5    0.0
6    7.0
7    8.0
Name: id, dtype: float64

In [29]:
missing_values = ['n/a', '', ' ', '--']
df = pd.read_csv('D:/Study/MCA/4th Sem/DA/csv/emp.csv', na_values = missing_values)
df.head()

    id      name  salary  start_date        dept
0  1.0      Rick  623.30  01-01-2012          IT
1  2.0       Dan  515.20  23-09-2013  Operations
2  3.0  Michelle     NaN  15-11-2014          IT
3  4.0      Ryan  729.00  11-05-2014          HR
4  NaN      Gary  843.25  27-03-2015     Finance

In [31]:
# now it can identify missing values as null value
df['id'].isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
Name: id, dtype: bool

In [37]:
# Dropping od single column
df = pd.read_csv('D:/Study/MCA/4th Sem/DA/csv/emp.csv')
df.head()

  id      name  salary  start_date        dept
0  1      Rick  623.30  01-01-2012          IT
1  2       Dan  515.20  23-09-2013  Operations
2  3  Michelle     NaN  15-11-2014          IT
3  4      Ryan  729.00  11-05-2014          HR
4         Gary  843.25  27-03-2015     Finance

In [38]:
# Dropping of columns
df.drop(columns = ['id'])

       name   salary  start_date        dept
0      Rick   623.30  01-01-2012          IT
1       Dan   515.20  23-09-2013  Operations
2  Michelle      NaN  15-11-2014          IT
3      Ryan   729.00  11-05-2014          HR
4      Gary   843.25  27-03-2015     Finance
5      Nina  8478.00  21-05-2013          IT
6     Simon  1032.80  30-07-2013  Operations
7      Guru   922.50  17-06-2014     Finance

In [39]:
# Deleting of specific rows
df.drop([0,1])

  id      name   salary  start_date        dept
2  3  Michelle      NaN  15-11-2014          IT
3  4      Ryan   729.00  11-05-2014          HR
4         Gary   843.25  27-03-2015     Finance
5  6      Nina  8478.00  21-05-2013          IT
6  7     Simon  1032.80  30-07-2013  Operations
7  8      Guru   922.50  17-06-2014     Finance

In [40]:
df = pd.read_csv('D:/Study/MCA/4th Sem/DA/csv/emp.csv')
df.head()
x = df['salary']
print(x)

0     623.30
1     515.20
2        NaN
3     729.00
4     843.25
5    8478.00
6    1032.80
7     922.50
Name: salary, dtype: float64

In [42]:
x = x.dropna()
print(x)

0     623.30
1     515.20
3     729.00
4     843.25
5    8478.00
6    1032.80
7     922.50
Name: salary, dtype: float64

In [52]:
degree = ["Low", "Medium", "High"]

# Equi width binning
categorical_object = pd.cut(x, 3)
print(categorical_object)
# Equi frequency binning
categorical_object2 = pd.qcut(x, 3, labels = degree)
print(categorical_object2)

0    (507.237, 3169.467]
1    (507.237, 3169.467]
3    (507.237, 3169.467]
4    (507.237, 3169.467]
5     (5823.733, 8478.0]
6    (507.237, 3169.467]
7    (507.237, 3169.467]
Name: salary, dtype: category
Categories (3, interval[float64]): [(507.237, 3169.467] < (3169.467, 5823.733] < (5823.733, 8478.0]]
0       Low
1       Low
3       Low
4    Medium
5      High
6      High
7    Medium
Name: salary, dtype: category
Categories (3, object): [Low < Medium < High]

In [47]:
pd.value_counts(categorical_object)

(507.237, 3169.467]     6
(5823.733, 8478.0]      1
(3169.467, 5823.733]    0
Name: salary, dtype: int64

In [48]:
# checks for equal number of values
# can be changed from numerical to categorical
pd.value_counts(categorical_object2)

Low       3
High      2
Medium    2
Name: salary, dtype: int64